# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
# Conv : [out_channels, kernel_size, stride, padding]
# SuperConv2d : c1, c2, k, s, p, c_list, k_list
# SuperC3 : c1, c2, n=1, shortcut=True, g=1, e_list, bottleneck_e_list
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, SuperConv2d, [128, 3, 2, None, [32, 48, 64], [1,3,5,'dilated']]],  # 1-P2/4
   [-1, 3, SuperC3, [128]],
   [-1, 1, SuperConv2d, [256, 3, 2, None, [64, 96, 128], [1,3,5,'dilated']]],  # 3-P3/8
   [-1, 6, SuperC3, [256]],
   [-1, 1, SuperConv2d, [512, 3, 2, None, [128, 192, 256], [1,3,5,'dilated']]],  # 5-P4/16
   [-1, 9, SuperC3, [512]],
   [-1, 1, SuperConv2d, [1024, 3, 2, None, [256, 384, 512], [1,3,5,'dilated']]],  # 7-P5/32
   [-1, 3, SuperC3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
